import math #импорт модуля math
a = int(input("Введите целое число a: ")) #ввод с клавиатуры числа a
b = int(input("Введите целое число b: ")) #ввод с клавиатуры числа b
print("a + b = ", a+b) #вывод суммы a и b
print("a - b = ", a-b) #вывод разницы между a и b
print("a * b  = ", a*b) #вывод произведения a и b
print("a / b = ", a/b) #вывод частного от деления a на b
print("a % b = ", a%b) #вывод остатка от деления a на b
print("log10(a) = ", math.log10(a)) #вывод десятичного логарифма числа a
print("a ** b = ", a**b) #вывод результата возведения числа a в степень b

